ChrisCarchipulla/RI-Proyecto-G3/firmware_nodo_ble/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c6"

# Habilitar BLE (Bluetooth Low Energy)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y

# Deshabilitar Classic BT (no lo usamos, ahorra memoria)
CONFIG_BT_CLASSIC_ENABLED=n

# BLE GATT — tamano de MTU maximo
CONFIG_BT_GATT_MAX_SR_PROFILES=1
CONFIG_BT_GATT_MAX_SR_ATTRIBUTES=10

# NVS requerido por BT
CONFIG_NVS_ENCRYPTION=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
